app/controllers/api/v1/courses_controller.rb

  def index
     # we can also use pagination here
    course_data = Course.includes(:tutors).as_json(
      only: %i[name code], include: { tutors: { only: %i[name contact_number] } }
    )
---
SELECT "courses"."name", "courses"."code" FROM "courses"
SELECT "tutors".* FROM "tutors" WHERE "tutors"."course_id" IN ($1, $2)  [["course_id", 1], ["course_id", 2]]